{"Name":"通天商会","DisplayName":"通天商会","GameVersion":1.252,"Version":6.01,"Desc":"[作者]\r\n    枫纹墨客\r\n[简介]\r\n通天商会是由枫稳墨客开发出来的一款带有交易系统的Mod，这里有无尽神物，仙人遗骨，逆天丹药，应有尽有，随君选择，MOD官方Q群734295338，欢迎加入，打击盗版，支持正版，享受健康游戏\n\n下面正式进入教程：\n首先进入游戏后点击建造界面，选择商会部分，有两种建筑，拍卖行与轮回阁，拍卖行你可以买到各种物品，而轮回阁可以回收一些天材地宝，拍卖行功能极多，万宝，拍卖，化运楼、玲珑阁。\n\n万宝：你可以在这里买到几乎你想要的一切，除了一般食物，石料，毛皮，珀等凡物外，朱果，金莲，神玉等应有尽有，前提是，你出得起价钱。\n\n化运楼：你如果想要改变你的命运，化运楼是个不错的选择，分为蕴珍坊跟玲珑阁，蕴珍坊藏宝于石料之中的，究竟是凡品还是神物，玲珑阁灵石转动骰子，是大，是小，是一次暴富，还是一无所有，皆看你气运。\n\n拍卖行：自古以来神丹与神物，有缘者得之，拍卖行向来不出凡物，夺天地造化的神丹，秉天地而生的神物，其中不仅看你的机缘，更看你的财力，其中神丹拍卖，网罗丹方早已失传的逆天神丹，不仅有可以增加五维而毫无副作用的五行丹药，更有遮蔽天机降低道行的道行丹，甚至可以降低自身天谴而毫无抗药的天谴神丹，而神物拍卖不仅会出现龙鳞，造化玉籽等天赐之物，甚至会有仙人遗骨，天劫之息等九死一生方能获得的天赐之物你有缘将其收入囊中否？\n\n轮回阁：若你有缘取得神物，但对你无用，何不将其放入商会，商会会给你一个“公道”的价格，将神物换成灵石来竞争你想要的神物，只是，你要承受一点小小的“手续费”哦！若你苦于无缘神物，何不来通天商会看一看呢？你会得到你想要的一切！！！\n","Author":"枫纹墨客","UIPackage":"UI/Moke,UI/Moketwo,UI/PushMore","ID":"2478542298","Flag":1121621795,"Tags":["Elixir","Item","Building","Usability","Integrated","Content","ExcludeRealmsHeaven"],"IncreasedDesc":"重要更新\n1.1.2更新内容：\r\n1、直接优化了灵点支票的兑换流程。\r\n2、赌场底金上限变为10万。\r\n3、加入了赭黄精。\r\n\r\n1.1.3更新内容：\r\n更新：\r\n增加功能：通天商会打通大陆重要商道，仙凡再度连接，曾经各大门派苦于没有资质上佳弟子，凡人苦于仙路无门，通天商会特设招贤处，各大门派可在此向天下大城发布招贤令，挑选弟子不必奔波于各 大城市之间自可有凡人投奔，门派扩充指日可待。\r\n\r\n\r\n1.1.4更新内容：\r\n修复：修复了之前的优化购物后仍然退出的原因\r\n\r\n1.1.5更新内容：\r\n修复：\r\n1、1000灵晶兑换五百灵点的问题。\r\n2、灵石兑换容易出现bug。\r\n3、矿石显示价格与物品购买价格不匹配问题.\r\n\r\n1.1.6更新内容\r\n更新：\r\n1.增加了新版本物品兑换和物品拍卖：\r\n2.优化部分用户体验0.0\r\n\r\n1.1.7更新内容\r\n更新：三巨头的合作日益密切，考虑到各门各派的特产丹药和储备问题，通天商会预设丹药寄售系统， 打通天下各派的丹药流通，进一步提高天下各派的总体水平。\r\n\r\n1.1.8更新内容\r\n自从天地大变，凶兽现身，大能出世以来，修仙界暗流汹涌，商会却平静无比，甚至有传言三大巨头不再做商会之言论，然而，近期三大巨头同时发布声明，商会重新出世，全面开放之前所有生意，原来，从太一小乾坤界出世后，巨头潜心研究，终于破解其部分秘密，可以利用乾坤界进行直接交易，故去除灵票限制，更多功能，欢迎注册商会体验。商会折扣，商会会员等级越高，优惠更多，欢迎各位掌门进群加盟。\r\n修复：\r\n1、轮回阁装修：修改UI界面，重点道具特殊颜色显示\r\n2、优化购物：去除出售交易灵票限制，直接根据乾坤界灵石进行交易\r\n更新：\r\n乾坤界加强：巨头研究乾坤界后，可以将更多物品直接收入小乾坤界\r\n乾坤界交易：商会库存可在门派允许之下沟通乾坤界 ，直接于乾坤界内进行交易\r\n\r\n2.0.0更新内容：\r\n三大巨头并不满足仅仅从乾坤界内取出货物，正在钻研跨门派存取之术，待功成之时，掌门即可用己方门派小乾坤界与外界进行交易，省却奔波劳累之苦。\r\n修复：\r\n1、购物页面跳转bug\r\n2、商会遗失建筑以去除\r\n更新：\r\n化运楼、蕴珍坊、玲珑阁装修：修改UI界面，重点道具特殊颜色显示\r\n全新购物存取系统：现如今通天商会已经掌握小乾坤界技术，购物便捷度达到巅峰\r\n购物便捷性加强：巨头研究乾坤界后，可以使用乾坤界灵石库存直接购买，购买后物品直接进入乾坤界中\r\n\r\n2.0.1更新内容：\r\n修复部分bug，与测试未删除内容\r\n\r\n2.0.2更新内容：\r\n修复：\r\n1、修复购买未获得物品bug\r\n更新：\r\n1、将购买的物品从乾坤界生成改为附加生成（方便使用各类物品）\r\n2、优化了购物流程\r\n\r\n2.0.3更新内容：\r\n有妖魔作祟，捣毁拍卖行与化运阁，令其无法正常运转，今有大能，降妖除魔，用土石之术，重建之，自今日起，商会大门，畅通无阻，欢迎各位，掌门光临。\r\n修复：\r\n1、修复购买运气石未获得物品bug\r\n2、修复各类UI跳转问题\r\n\r\n2.0.4更新内容：\r\n经通天商会内部自查，偷换各位掌门丹药，篡改竞拍阵法的贼子已经伏法，拍卖行秩序恢复正常，同时拍卖行装修已经完成。欢迎各位掌门来这里彰显财力，争夺机缘！\r\n优化：\r\n1、修复拍卖行无法参与拍卖\r\n2、优化了购物的UI设计，重点道具特殊颜色显示\r\n3、修复了石髓无法购买的问题\r\n\r\n2.0.5更新内容：\r\n继贼子伏法，被恶意偷换的丹药目前已经全部排查完毕，商会丹道大能开炉炼丹，丹药库存充足，神丹拍卖行秩序恢复正常。自此，商会三大分部已全部整合完毕，欢迎各位掌门光临！\r\n优化：\r\n1、修复拍卖行丹药无效的问题\r\n2、修复化运楼跳转至拍卖行问题\r\n\r\n2.0.6更新内容：\r\n优化：\r\n1、修复招贤令无法使用的问题\r\n\r\n2.2.0更新内容：\r\n经理了天道变动，目前各门派欣欣向荣，交易日益密切，三大巨头商量后，决定回馈各位贵宾，即日起在通天商会消费一定灵石的客人，购买物品时可享受一定折扣，最高可享有五成优惠，欢迎各位贵宾光临\r\n（会员等级从低到高分为：黄、玄、地、天、辰、星，月，日， 荒、洪、宙、宇）\r\n\r\n2.21更新内容：\r\n1、据各大门派反应，天下行商会其中部分商人恶意收购丹药，低价出售扰乱市场秩序，经通天商会核实，现颁布禁商令，天下行商与各大门派不可出售商会五行灵丹、蕴灵丹、天谴丹等奇珍，望各位掌门自重。\r\n2、价格调整:自天道变动，大能出世，物价亦混乱不堪，如今各大门派趋于稳定，通天商会重新评估了拍卖行丹药价格，减少各位掌门亏损。\r\n3、恒温箱:乾坤界的出现让朱果玄牝珠可以不再影响周围温度，故去除恒温箱，直接送入各大门派乾坤界中，交易更加方便。\r\n4、商会与行商没有任何关联，从此互不受影响。\r\n\r\n3.00更新内容：\r\n经过通天商会之中大能共同研究，终于发现此间天道规律，悟山河之理，观造化奥妙，成欺天之法，终是研究出改天换地术，以灵石为引，以天地为基，即可改天换地，可改山河表里，血池、灵土、山川、河流，可改风云天气，焚风、暴雨、雷电、永夜，无不可改，无不可为。自此，门派尽由各位掌门掌控，不再受山河天地所困，可尽展才能！\r\n\r\n4.00更新内容：\r\n1、因商会稳步发展，大陆各门派往来日益紧密，门派之间无论大小，皆可互通有无，商会为其奔走，有掌门不断反馈，打包出售流程繁琐，且不易操作，商会经过重新整修，更改流程，现各位掌门可以自由选择交易数量，更加自由的选取自己心仪物资，不必再心烦其中流程。（购置与出售都会在轮回阁中进行）\r\n2、而随着天道动荡，各类神物层出不穷，以往的神物不必经过争抢即可获得。故而关闭通天拍卖行，期间神物、丹药、年货、盲盒、镇物等等一同加入商品，各位掌门可各取所需。\r\n3、叶玄也曾主动寻得商会，委托商会出售其拍卖行入场券，手持入场券可随时参加黑沙滩叶玄拍卖会，若神物在商会之中无力购买，也可去其中寻得机缘。\r\n注：因四时变换，供求无常，各项宝物物价亦常有浮动，如何争取机缘，还请各位掌门自行掌握。\r\n4.1更新内容：完全修复行商获取物品问题。\r\n\r\n4.2更新内容：修复道行丹UI不显示问题。\r\n\r\n4.3更新内容：添加其余两种祈福硬币，添加符纸、灵血符、神珀符出售购买。\r\n\r\n4.4更新内容：\r\n1、蕴珍坊价格调整与收获调整：九天龙脉乃是整个大陆龙脉汇聚之所，乃天仓大陆气运之所在，其中石料浸染龙气，自成一片世界，蕴灵其中，随着开采，蕴灵更长的石料随之现世，其中开出灵物种类数量更多，然石料天成，其中神物肉眼难辨，考验各位掌门的不只有眼力，还有运气。若掌门自信，欢迎尝试。\r\n2、万宝阁部分物价降价，部分UI优化。\r\n\r\n4.42更新内容：\r\n经商会沟通，与其他各界交流摩擦大大减小，掌门不比二选一。（程序函数优化，减少了大量的MOD冲突与各种问题。）\r\n\r\n4.43更新内容：\r\n修复：修复部分物品物价错乱等问题。\r\n\r\n4.45更新内容：\r\n修复：修复万宝阁无法打开问题。\r\n\r\n4.46更新内容：\r\n优化：优化价格计算流程，库存灵石更新显示。\r\n\r\n4.5更新内容：\r\n1、天道口令：为缓解各掌门门派初期物资不足，商会三大巨头决定，向天苍大陆提供天道口令，掌门若得之，将其交由商会，即可获取商会赠与之机缘一份。各位掌门可自行寻找。\r\n2、商会中不乏精通御兽一道大佬，其中仙人深林研制的饲养妖兽之法使得妖兽材料不必冒死获取，商会因此新增大量妖兽掉落，各位掌门可自行购置给门派强者。\r\n3、优化订单，商会最初改版，大量订单纷至沓来，商会一时处理不及，现优化购置流程，大量灵石订单亦可顺利完成。掌门不必再为此翻新。（优化内存溢出造成的卡顿）\r\n\r\n4.51更新内容：\r\n1、将妖兽掉落补充进乾坤界之中。\r\n2、优化积分算法使其不会超过20亿积分变为负数。（官方防溢出设定）\r\n3、新增更新补贴，天道口令可在B站最新介绍视频上获得。\r\n\r\n4.52更新内容：\r\n1、补充出售更多物品。\r\n2、下调会员升级需求。（积分可由天道口令大量获得）\r\n3、新增更新补贴，天道口令可在B站最新介绍视频上获得。\r\n\r\n4.53更新内容：\r\n1、修复糊泥刀、缝纫护腕、磨面之遮UI丢失问题。\r\n2、新增更新补贴，天道口令可在B站最新介绍视频上获得。\r\n\r\n5.00更新内容：\r\n1、经由一段时间市场调节，商会发现大量物品商会之中溢价严重，各位掌门苦不堪言，经由商会调查，大量物品降价，极大节约各掌门成本。\r\n2、随着商会产业扩大，更多门派的加入，更多遗迹的发掘，之前稀有物品，如灵髓脂，血髓脂，神舍利，执念结晶等物品亦可以加入出售行列，各位掌门不必为此奔波\r\n3、因大陆欣欣向荣，各灵药需求亦逐步上升，灵药价格上调，随之，各位产出灵药的门派收益增加。\r\n4、产业结构调整，价格浮动亦有变化.购买区间由【80~200】下降为【50~200】，出售区间由【10~200】提升为【30~250】，轮回阁收购价格调整由于整体浮动调整为十分之一，神兽材料为由于获取利润过高调整二十分之一。\r\n5、经由众位仙家决定，逆天坛更名凌云阁，一并建立纳贤居，二者合并，统称玄机阁，可由仙人出面为门派招募弟子，亦可亲自出手改天换地，因仙人手段无穷，故常有妖修，野兽慕名而来，各位掌门可以随意挑选。（新增妖族、野兽招募）\r\n6、商会建立初期，有些掌门发现重复选择购买后立刻出售可以获取大量灵石，利用商会信息处理不及恶意套取商会灵石，现结构调整，此法已失效，望掌门自重。\r\n7、经过通天商会之中大能研究，最终研发虚空传输**，各大仙家可选物品于乾坤界生成或视窗中间生成，方便各仙家使用。\r\n修复：\r\n1、镇物失效的问题。\r\n2、龙凤蛋无法孵化的问题，不可放入乾坤界锁定生成于视窗中间。（放入乾坤界会丢失物品属性）\r\n3、镇物失效问题修复，不可放入乾坤界锁定生成于视窗中间。（放入乾坤界会丢失物品属性）\r\n\r\n5.01更新内容：\r\n1、新增四把绝世好剑的出售。\r\n2、新增六一儿童天道口令。\r\n优化：\r\n1、优化天道口令兑换后的UI刷新机制。\r\n2、优化轮回阁乾坤界物品取出位置。（现在乾坤界物品取出不会优先在建筑后方）\r\n\r\n5.02更新内容：\r\n1、修复万宝阁出售bug。\r\n2、降低劫灰价格。\r\n\r\n5.03更新内容：\r\n1、修复几个天道口令无法兑换问题。\r\n\r\n5.04更新内容：\r\n1、修复季节无法浮动bug。\r\n\r\n5.1更新内容：\r\n1、因天道无常，各种价格时有变动，商会不适会调整物价，稳定市场。\r\n2、自古天下灵兽，有德者居之，然灵气复苏，灵兽豢养之法亦有突破，商会掌握灵契转换之法，新增灵契出售，自此，掌门可自行挑选坐骑，以争仙缘。\r\n3、乾坤界与轮回阁本是天地奇物，稍加掌控，即可自动收纳其中，虽灵智不高，但可替各位掌门收纳各类物资，不必耗费人手整理，各位外门更可借此勤加练习，以踏仙途。\r\n\r\n5.2更新内容：\r\n1、新增自定义乾坤界补丁，订阅自定义乾坤界会激活该补丁，解锁乾坤界内物品模组与原有的增删改查。\r\n\r\n5.21更新内容：\r\n1、清除读档弹窗bug。\r\n\r\n5.22更新内容：\r\n1、调整自定义乾坤界设置存储功能，使得原本无法储存的内容得以储存读取。\r\n\r\n5.23更新内容：\r\n1、修复玄机阁购买功能bug。\r\n\r\n5.3更新内容：\r\n1、修复神兽蛋无法孵化的问题。\r\n2、新增催更信息面板可以实时查看催更信息。\r\n\r\n5.91更新内容：\r\n1、新增外部其他mod接口（mod文件里Example样例）。\r\n\r\n\r\n更多精彩功能，请期待枫稳墨客商会更新\r\n更新消息请关注枫纹墨客B站主页https://space.bilibili.com/262285975\r\nMOD官方bug反馈Q群：734295338\r\n     *******************\r\n     *（枫纹墨客）出品 *\r\n     *******************\r\n","IsInsideCreat":false,"Previews":[],"ParentModInfo":null}